Revit 2027 API
BuiltInFailures.MEPCalculationFailures.MechanicalEquipmentSetBeingDeleted Property
 The mechanical equipment set was deleted because it no longer contained any members.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MechanicalEquipmentSetBeingDeleted { get; }
Public Shared ReadOnly Property MechanicalEquipmentSetBeingDeleted As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MechanicalEquipmentSetBeingDeleted {
	FailureDefinitionId^ get ();
}
static member MechanicalEquipmentSetBeingDeleted : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace